#include <hidef.h>	
#include <mc9s12hy64.h>
#include "buzzer.h"

//控制鸣响频率
volatile unsigned int Buzzer_ToggleTimeout;
//允许打开标志
bool Buzzer_RingEnableFlag = false;
bool Buzzer_RingingFlag = false;

/**********************************************************************
@ Func:  蜂鸣器初始化
@ Brief: 蜂鸣器控制端口为PP4，蜂鸣器类型为有源
**********************************************************************/
void Buzzer_Init()
{
  DDRP |= (1 << 4);
  PTP &= ~(1 << 4);
}

/**********************************************************************
@ Func:  蜂鸣器打开
**********************************************************************/
void Buzzer_Open()
{
  PTP |= (1 << 4);
  Buzzer_RingingFlag = true;
}

/**********************************************************************
@ Func:  蜂鸣器关闭
**********************************************************************/
void Buzzer_Close()
{
  PTP &= ~(1 << 4);
  Buzzer_RingingFlag = false;
}

/**********************************************************************
@ Func:  蜂鸣器交替打开、关闭
**********************************************************************/
void Buzzer_Toggle()
{
  if(Buzzer_RingingFlag)
  {
    Buzzer_Close();
  }
  else
  {
    Buzzer_Open();
  }
}

/**********************************************************************
@ Func:  获取蜂鸣器状态
**********************************************************************/
Buzzer_State_t Buzzer_GetState()
{
  if(PTP & (1 << 4))
  {
    return BUZZER_RINGING;
  }
  
  return BUZZER_CLOSED;
}